OlegDemk/stm32F401CCU_NTF24L01_RX_TX_Sleep/1. TX/Core/Src/main.c
}
// End BME280 part/////////////////////////////////////////////////////////////////////////////////////
// --------------------------------------------------------------------------------
void meassure_battery_voltage(char * buff)
{
	uint16_t i = 0;
	char str[35]={0};

	HAL_ADC_Start(&hadc1);
	HAL_ADC_PollForConversion(&hadc1, 100);
//		i = (uint32_t)HAL_ADC_GetValue(&hadc1);
	HAL_ADC_Stop(&hadc1);

	float V_bat = (float)HAL_ADC_GetValue(&hadc1)*3.3/4096;

	char buffer[10] = {0,};
	float battery_voltage = 0;

	memset(buffer, 0, sizeof(buffer));
	sprintf(buffer, "V%.1f ", V_bat);
	strcat(buff, buffer);
}
// --------------------------------------------------------------------------------
void led_test_blink(uint16_t times, uint16_t delay)
{
	for(int i = 0; i <= times; i++)
	{
		RED_LED_ON;
		GREEN_LED_ON;
		HAL_Delay(delay);
		RED_LED_OFF;
		GREEN_LED_OFF;
		HAL_Delay(delay);
	}
}
// --------------------------------------------------------------------------------------
void error_blink_red_led(void)
{
	while(1)
	{
		RED_LED_TOGLE;
		HAL_Delay(100);
	}
}
// --------------------------------------------------------------------------------------
void read_time(char * buff)
{

	time_i2c_write_single(DS3231_I2C_ADDRESS, 0x0E, 0x04);			// Turn Off square wave signal on SQW Pin DS3231
	time_i2c_write_single(DS3231_I2C_ADDRESS, 0x0F, 0x00);			// Turn Off square wave signal on 32K Pin DS3231

	uint8_t buffer = 0;
	uint8_t time_ds3231[10] = {0,};

	for(int i = 0; i <=8; i++)
	{
		ds3231_read(i, &buffer);
		time_ds3231[i] = buffer;
	}

	// convert time into string
	char buf_1[5] = {0,};

	for(int i = 2; i >= 0 ; i--)	 // Зчитати ще день, мі�?�?ць і рік !!!!!!
	{
		sprintf(buf_1, "%d", time_ds3231[i]);
		strcat(buff, buf_1);
		memset(buf_1, 0, sizeof(buf_1));

		if(i > 0)
		{
			strcat(buff, ":");
		}
	}
	strcat(buff, " ");
}
// --------------------------------------------------------------------------------------
void set_time(void)		// For set time from TX
{


}


#define COUNTER_PACKET 1
#define COUNTER_RETRANSMITED_PACKET 2
#define COUNTER_LOST_PACKET 3
#define COUNTER_SECOND 4

void WriteBackupRegister(uint32_t data, uint8_t type)
{
	if(type == COUNTER_PACKET)
	{
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR1, data);
	}
	if(type == COUNTER_SECOND)
	{
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR4, data);
	}
}
// --------------------------------------------------------------------------------
uint32_t ReadBackupRegister(uint8_t type)
{
	if(type == COUNTER_PACKET)
	{
		return HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR1);
	}
	if(type == COUNTER_SECOND)
	{
		return HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR4);
	}

}
// --------------------------------------------------------------------------------
void counter(char* buff)
{



}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_RTC_Init();
  MX_I2C1_Init();
  MX_USART1_UART_Init();
  MX_SPI2_Init();
  MX_ADC1_Init();
  /* USER CODE BEGIN 2 */





#if SLEEP_MODE == ON






  ////////////////////////////////////////////////////////////////////////////////////////////////////////////


//  Зробити окремо два переивання:
//  1 .Від PA0 (Для перешивання) і входження в режим налаштувань
//
//  2. Від налаштованого RTC таймера для відсилання даних

  if (__HAL_PWR_GET_FLAG(PWR_FLAG_SB) != RESET)
  {
	  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_SB);  // clear the flag


	  HAL_PWR_DisableWakeUpPin(PWR_WAKEUP_PIN1);  // disable PA0

	  /** Deactivate the RTC wakeup  **/
	  HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);


	  // Якщо кнопка нати�?нута то перейти в не�?пл�?чий режим на 10 �?екунд (блимати ледом)
	  if(HAL_GPIO_ReadPin(GPIOA, ACTION_Pin) == 1)
	  {
		  char buf_uart_tx[50] = {0,};
		  sprintf(buf_uart_tx, "BUTTON ACTION PRESSED !\n\r");
		  HAL_UART_Transmit(&huart1, buf_uart_tx, sizeof(buf_uart_tx), 1000);

		  led_test_blink(10, 800);
	  }


	  uint32_t seconds = ReadBackupRegister(COUNTER_SECOND);

	  if(seconds >= 3)
	  {

		  char buf_uart_tx[50] = {0,};
//		  		 memset(buf_uart_tx, 0, sizeof(buf_uart_tx));
//		  		 sprintf(buf_uart_tx, "Wake Up ... COUNTER: %d\n\r", seconds);
//		  		 HAL_UART_Transmit(&huart1, buf_uart_tx, sizeof(buf_uart_tx), 1000);
//
//		  		 led_test_blink(10, 10);


#if LED == ON
	  GREEN_LED_ON;
#endif
	  char tramsmeet_data_buffer[50] = {0,};

	  get_THP_bme280(tramsmeet_data_buffer); 			// Meassure T, H and P
 	  meassure_battery_voltage(tramsmeet_data_buffer);  // Meassure voltage on battery
 	  read_time(tramsmeet_data_buffer);					// DS3231 clock

#if UART_LOG == ON
// 	  char buf_uart_tx[70] = {0,};
 	  memset(buf_uart_tx, 0, sizeof(buf_uart_tx));
 	  sprintf(buf_uart_tx, "TX data: %s \n\r", tramsmeet_data_buffer);
 	  HAL_UART_Transmit(&huart1, buf_uart_tx, sizeof(buf_uart_tx), 1000);
#endif



 	  // Detect loat packages



// 	  Записувати кількість передач в окремі функції

	  char buf1[10] = {0,};
	  char buf2[54] = {0,};

	  uint8_t retr_packages = 0;
	  uint8_t dt = 0 ;
 	  uint16_t lost_packages = 0;


// 	  ПУТАНИНА З ЦИМИ ЗМІННАМИ !!!! їх треба розділити
//	  RTC ЖОХУЯ БЕРЕ живлення на себе
 	  char buf_1[10] = {0,};
 	  uint32_t RTC_DATA = ReadBackupRegister(COUNTER_PACKET);
 	  memset(buf_1, 0, sizeof(buf_1));
 	  sprintf(buf_1, "C%d", RTC_DATA);
 	  strcat(tramsmeet_data_buffer, buf_1);


 	  NRF24_init_TX(0, 10, 0, 15, 0, 0);
 	  dt = NRF24L01_Transmit(1, tramsmeet_data_buffer);

 	  retr_packages  = dt & 0xF;			// Select retransmit packets
 	  lost_packages = dt & 0xF0;			// Select lost packets



#if UART_LOG == ON
 	  sprintf(buf2, "TX retr: %d, TX lost: %d, COUNTER_PACKET: %d\n\r", retr_packages, lost_packages, RTC_DATA);
 	  HAL_UART_Transmit(&huart1, buf2, sizeof(buf2), 1000);
#endif

 	  WriteBackupRegister(RTC_DATA+1, COUNTER_PACKET);

