OlegDemk/stm32F401CCU_NTF24L01_RX_TX_Sleep/1. TX/Core/Src/main.c
 	  if(lost_packages > 0)		// If lost packages was detected
 	  {
 		 RED_LED_ON;
 		 HAL_Delay(10);
 		 RED_LED_OFF;
// 		 HAL_UART_Transmit(&huart1, str, sizeof(str), 1000);
 	  }
 	  else
 	  {
 		 RED_LED_OFF;
 	  }

#if LED == ON
 	  GREEN_LED_OFF;
#endif

 	  NRF24_Sleep_mode();


 	  	  uint32_t ffff = 0;
 		  WriteBackupRegister(ffff, COUNTER_SECOND);
	  }


	  else
	  {
		  WriteBackupRegister(seconds+1, COUNTER_SECOND);		// Update counter of seconds
	  }


//#if LED == ON
//	  GREEN_LED_ON;
//#endif
//	  char tramsmeet_data_buffer[50] = {0,};
//
//	  get_THP_bme280(tramsmeet_data_buffer); 			// Meassure T, H and P
// 	  meassure_battery_voltage(tramsmeet_data_buffer);  // Meassure voltage on battery
// 	  read_time(tramsmeet_data_buffer);					// DS3231 clock
//
//#if UART_LOG == ON
// 	  char buf_uart_tx[70] = {0,};
// 	  sprintf(buf_uart_tx, "TX data: %s \n\r", tramsmeet_data_buffer);
// 	  HAL_UART_Transmit(&huart1, buf_uart_tx, sizeof(buf_uart_tx), 1000);
//#endif
//
//
//
// 	  // Detect loat packages
//
//
//
//// 	  Записувати кількість передач в окремі функції
//
//	  char buf1[10] = {0,};
//	  char buf2[54] = {0,};
//
//	  uint8_t retr_packages = 0;
//	  uint8_t dt = 0 ;
// 	  uint16_t lost_packages = 0;
//
// 	  char buf_1[10] = {0,};
// 	  uint32_t RTC_DATA = ReadBackupRegister(COUNTER_PACKET);
// 	  memset(buf_1, 0, sizeof(buf_1));
// 	  sprintf(buf_1, "C%d", RTC_DATA);
// 	  strcat(tramsmeet_data_buffer, buf_1);
//
//
// 	  NRF24_init_TX(0, 10, 0, 15, 0, 0);
// 	  dt = NRF24L01_Transmit(1, tramsmeet_data_buffer);
//
// 	  retr_packages  = dt & 0xF;			// Select retransmit packets
// 	  lost_packages = dt & 0xF0;			// Select lost packets
//
//
//
//#if UART_LOG == ON
// 	  sprintf(buf2, "TX retr: %d, TX lost: %d, COUNTER_PACKET: %d\n\r", retr_packages, lost_packages, RTC_DATA);
// 	  HAL_UART_Transmit(&huart1, buf2, sizeof(buf2), 1000);
//#endif
//
// 	  WriteBackupRegister(RTC_DATA+1, COUNTER_PACKET);
//
// 	  if(lost_packages > 0)		// If lost packages was detected
// 	  {
// 		 RED_LED_ON;
// 		 HAL_Delay(10);
// 		 RED_LED_OFF;
//// 		 HAL_UART_Transmit(&huart1, str, sizeof(str), 1000);
// 	  }
// 	  else
// 	  {
// 		 RED_LED_OFF;
// 	  }
//
//#if LED == ON
// 	  GREEN_LED_OFF;
//#endif
//
// 	  NRF24_Sleep_mode();


 	  /** Disable the WWAKEUP PIN **/
 	  HAL_PWR_DisableWakeUpPin(PWR_WAKEUP_PIN1);  // disable PA0

 	  /** Deactivate the RTC wakeup  **/
 	  HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);
   }


  /** Now enter the standby mode **/
    /* Clear the WU FLAG */
   __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);

    /* clear the RTC Wake UP (WU) flag */
   __HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(&hrtc, RTC_FLAG_WUTF);


    /* Enable the WAKEUP PIN */
   HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN1);

   if (HAL_RTCEx_SetWakeUpTimer_IT(&hrtc, WakeUpCounter_5_sec, RTC_WAKEUPCLOCK_RTCCLK_DIV16) != HAL_OK)
   {
     Error_Handler();
   }

   /* Finally enter the standby mode */
   HAL_PWR_EnterSTANDBYMode();

#else





#endif
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

	  //////////////////// TX ///////////////////////
//	  NRF24L01_Transmit(1, "1234567890");
//	  HAL_Delay(1000);
	  ///////////////////////////////////////////////

	  //////////////////// RX ///////////////////////
//	   NRF24L01_Receive();
	  ///////////////////////////////////////////////

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 64;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */

  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.ScanConvMode = DISABLE;
  hadc1.Init.ContinuousConvMode = DISABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 1;
  hadc1.Init.DMAContinuousRequests = DISABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_9;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

